package dev.weazyexe.wretches.ui.main

import dev.weazyexe.wretches.entity.Crime

private val DEFAULT_CRIMES = listOf(
    Crime(
        "1",
        "Губка в раковине",
        "Это какое-то безобразие, да кто же так делает! Убирайте на кухню",
        true
    ),
    Crime("2", "Грязный стол", "Кто-то не убрался после еды", true),
    Crime("3", "Пол в песке", "Пустыня Сахара в 519 кабинете", false),
    Crime(
        "4",
        "Нет воды в кулере",
        "Вода в кулере закончилась и кто-то не соизволил обновить бутыль",
        false
    ),
    Crime("5", "Кто съел все мятные пряники??", "Нужно спросить у Шлёпы", true),
    Crime("6", "Чай", "Коллеги пошли на чай и не позвали меня, непорядок", false),
    Crime("7", "Тестовый девайс", "Разбили Nokia 6.1 на 10 андроиде", false),
    Crime("8", "Дорогой Миша, вот тебе диплинк!", "Отправили в прод тестовый пуш", true),
    Crime("9", "Пол в песке", "Пустыня Сахара в 519 кабинете", false),
    Crime(
        "10",
        "Нет воды в кулере",
        "Вода в кулере закончилась и кто-то не соизволил обновить бутыль",
        false
    ),
    Crime("11", "Кто съел все мятные пряники??", "Нужно спросить у Шлёпы", true),
    Crime("12", "Чай", "Коллеги пошли на чай и не позвали меня, непорядок", false),
)

/**
 * Состояние экрана [MainActivity]
 */
data class MainState(
    val crimes: List<Crime> = DEFAULT_CRIMES
)

/**
 * Сайд эффекты экрана [MainActivity]
 */
sealed class MainEffect